# -*- coding: utf-8 -*-
"""Описание"""
__title__ = 'Заполнение\nпространств'
__author__ = 'SG'

import clr
clr.AddReference('System.Core')
from System.Collections.Generic import *

from Autodesk.Revit.DB import FilteredElementCollector, BuiltInCategory, Transaction, TransactionGroup, BuiltInParameter, ElementId

doc = __revit__.ActiveUIDocument.Document
uidoc = __revit__.ActiveUIDocument

t = Transaction(doc, 'Заполнение пространств')
t.Start()

# в конце строки не должно быть пустоты
src = """17	Операционная	А		21	43,3	3	130	31	25	4000	3200	Ламинар	Вытяжные шкафы	К01	В01
19	Операционная	А		21	38,0	3	114	35	28	4000	3200	Ламинар	Вытяжные шкафы	К02	В02
27	Операционная	А		21	42,6	3	128	31	25	4000	3200	Ламинар	Вытяжные шкафы	К03	В03
29	Операционная	А		21	42,3	3	127	31	25	4000	3200	Ламинар	Вытяжные шкафы	К04	В04
30	Шлюз	В		21	4,7	3	14	5	0	70		H11		К05	.
14	Помещение подготовки пациента	В		21	16,9	3	51	6	8	305	405	H11	4АПН+ЗКСД	К05	В05
15	Предоперационная	В		21	13,8	3	41	6	8	250	330	H11	4АПН+ЗКСД	К05	В05
16	Помещение подготовки пациента	В		21	16,7	3	50	6	8	300	400	H11	4АПН+ЗКСД	К05	В05
18	Стерилизационная для экстренной стерилизации	В		21	10,8	3	32	6	4	200	130	H11	4АПН+ЗКСД	К05	В05
21	Шлюз	В		21	7,1	3	21	5	0	110		H11		К05	В05
22	Шлюз для RG оборудования	В		21	5,5	3	16	5	0	80		H11		К05	В05
24	Помещение подготовки пациента	В		21	16,2	3	49	6	8	290	390	H11	4АПН+ЗКСД	К05	В05
25	Предоперационная	В		21	14,8	3	44	6	8	265	355	H11	4АПН+ЗКСД	К05	В05
26	Помещение подготовки пациента	В		21	16,2	3	49	6	8	290	390	H11	4АПН+ЗКСД	К05	В05
28	Стерилизационная для экстренной стерилизации	В		21	12,6	3	38	6	4	220	150	H11	4АПН+ЗКСД	К05	В05
31	Помещение подготовки крови и кровезаменителей	Г		21	11,3	3	34	8	6	275	205	ДПУ	ДПУ	К05	В05
46	Палата  реанимации и интенсивной терапии на 7 коек	Б		21	99,2	3	298	10	8	3000	2400	H13	4АПН+ЗКСД	К06	В06
47	Манипуляционная	В		21	11,7	3	35	6	8	210	280	H11	4АПН+ЗКСД	К06	В06
62	Палата интенсивной терапии	Б		21	17,6	3	53	10	8	540	430	H13	4АПН+ЗКСД	К06	В06
59	Боксированная палата	Б		21	17,1	3	51	8	11	400	550	H13	4АПН+ЗКСД	К07	В07
58	Шлюз	В		21	4,2	3	13	12	0	150		H11		К07	.
37	Шлюз	Г		21	17,9	3	54	3	0	160		ДПУ		К08	.
40	Шлюз	Г		21	5,4	3	16	6	0	100		ДПУ		К08	.
32.9	Проход	Г		21	9,5	3	29			150		ДПУ		К08	.
39	Шлюз	Г		21	8,2	3	25	6	0	150		ДПУ		К08	.
41	Помещение персонала	Г		21	26,8	3	80	2	0	190		ДПУ		К08	.
43	Проход	Г		21	60,5	3	182	4	0	650		ДПУ		К08	.
8	Комната психологической разгрузки	В		21	20,4	3	61	4	4	240	240	H11	4АПН+ЗКСД	К08	В08
10	Кладовая расходников НДА	Г		21	7,9	3	24	0	2		50		ДПУ	К08	В08
12	Кладовая инструментов, шовного материала	В		21	22,6	3	68	6	4	405	270	H11	4АПН+ЗКСД	К08	В08
23	Помещение мойки и обеззараживания НДА	Г		21	19,7	3	59	3	4	180	235	ДПУ	ДПУ	К08	В08
38	Проход	Г		21	24,0	3	72	4	4	270	270	ДПУ	ДПУ	К08	В08
32.1	Санпропускник-3	Г		21	6,4	3	19				100		ДПУ	К08	В09
32.2	Санпропускник-3	Г		21	6,5	3	19				100		ДПУ	К08	В09
32.3	Санпропускник-1	Г		21	12,1	3	36	0	4		150		ДПУ	К08	В09
32.4	Санпропускник-1	Г		21	11,9	3	36				150		ДПУ	К08	В09
32.5	Санпропускник-2	Г		21	3,6	3	11			175		ДПУ		К08	В09
32.6	Санпропускник-2	Г		21	4,0	3	12			175		ДПУ		К08	В09
32.7	Санузел	Г		21	1,1	3	3				50		ДПУ	К08	В09
32.8	Санузел	Г		21	1,1	3	3				50		ДПУ	К08	В09
2	Коридор	Г		21	18,8	3	57	3	3	160	160	ДПУ	ДПУ	К08	В10
51	Помещение персонала	Г		21	13,3	3	40	6	7	240	300	ДПУ	ДПУ	К08	В11
53	Помещение старшей сестры	Г		21	11,0	3	33	3	4	100	120	ДПУ	ДПУ	К08	В11
54	Кабинет сестры хозяйки	Г		21	9,1	3	27	4	4	100	120	ДПУ	ДПУ	К08	В11
55	Ординаторская	Г		21	12,7	3	38	3	4	120	150	ДПУ	ДПУ	К08	В11
65	Помещение подготовки инфузионных систем	Г		21	11,7	3	35	4	3	140	110	ДПУ	ДПУ	К08	В11
1	Лестничная клетка			21	21,6	3	65	0,0	0,0						.
3	Коридор	Г		21	5,6	3	17	0	0						.
34.1	Проход	Г		21	26,0	3	78								.
9.1	Проход	Г		21	15,6	3	47								.
9.2	Проход	Г		21	10,2	3	31								.
70	Лестничная клетка			21	23,17	3	70								.
6	Шлюз	Г		21	7,6	3	23	0	7		150		ДПУ		В08
7	Шлюз	Г		21	6,0	3	18	0	8		150		ДПУ		В08
13	Кладовая НДА	Г		21	9,0	3	27	0	2		50		ДПУ		В08
9	Проход	Г		21	64,5	3	193	0	5		1000				В08
34	Проход	Г		21	104,7	3	314	0	5		1600		ДПУ		В08
33	Помещение уборочного инвентаря	Г		21	4,1	3	12	0	5		60		ДПУ		В09
36	Помещение уборочного инвентаря	Г		21	3,9	3	12	0	5		60		ДПУ		В09
69	Кладовая расходных материалов	Г		21	4,1	3	12				50		ДПУ		В09
4	Электрощитовая	Г		21	5,0	3	15	0	3		50		ДПУ		В10
5	Серверная	Г		21	8,0	3	24	0	2		50		ДПУ		В10
44	Шлюз	Г		21	5,1	3	15	0	12		180		ДПУ		В11
45	Шлюз	Г		21	5,1	3	15	0	12		180		ДПУ		В11
48	Подсобное помещение	Г		21	10,3	3	31	0	3		100		ДПУ		В11
52	Комната хранения чистого белья	Г		21	5,7	3	17	0	3		50		ДПУ		В11
57	Кладовая	Г		21	3,3	3	10	0	6		60		ДПУ		В11
61	Шлюз	В		21	4,7	3	14	0	7		100		ДПУ		В11
60	Слив	Г		21	3,4	3	10	0	6		60		ДПУ		В13
20	Помещение хранения мед. отходов	Г		21	5,7	3	17	0	10		170		ДПУ		В14
49	Слив	Г		21	2,1	3	6	0	16		100		ДПУ		В15
50	Слив	Г		21	2,6	3	8	0	13		100		ДПУ		В15
56	Комната уборочного инвентаря	Г		21	6,8	3	21	0	5		100		ДПУ		В15
63	Санузел	Г		21	5,3	3	16	0	5		80		ДПУ		В15
64	Санузел персонала	Г		21	3,6	3	11	0	14		150		ДПУ		В15
64.1	Санузел персонала	Г		21	1,6	3	5								В15
64.2	Санузел персонала	Г		21	2,0	3	6								В15
42	Комната хранения наркотических средств	Г		21	6,0	3	18	0	10		190		ДПУ		В16"""

spaces = FilteredElementCollector(doc)\
    .OfCategory(BuiltInCategory.OST_MEPSpaces)\
    .WhereElementIsNotElementType().ToElements()

# values = [x.split('\t') for x in src.split('\n')] Практика мэппинга:
values = map(lambda x: x.split('\t'), src.split('\n'))
# for i in values:
#     print('-------------')
#     for j in i:
#       if j:
#           print(j)
#       else:
#           print('-')
nums = map(lambda x: x[0], values)
# print nums
names = map(lambda x: x[1], values)
categ = map(lambda x: x[2], values)
supplyAir = map(lambda x: x[10], values)
exhaustAir = map(lambda x: x[11], values)
pritok = map(lambda x: x[12], values)
# for i, pos in enumerate(values):
# 	print '------------------------------------'
# 	print i
# 	print pos
vityajka = map(lambda x: x[13], values)
sysP = map(lambda x: x[14], values)
sysV = map(lambda x: x[15], values)
# vityajka = [i[13] for i in values]
# vityajka = []
# for i in values:
# 	print('{} - {}'.format(i[12], i[13]))
# 	vityajka.append(i[13])
# print 1222
existNums = []
for sp in sorted(spaces, key=lambda x: x.LookupParameter('Номер').AsString()):
    n = sp.LookupParameter('Номер').AsString()
    existNums.append(n)
    if n in nums:
        print(n)
        index = nums.index(sp.LookupParameter('Номер').AsString())
        sA = supplyAir[index]
        eA = exhaustAir[index]
        s = ''
        s1 = ''
        s2 = ''
        # if sA:
        #     s1 = '+{}'.format(sA)
        # if eA:
        #     s2 = '-{}'.format(eA)
        if sA and sA != '0':
            s1 = '{}: +{}'.format(sysP[index], sA)
        if eA and eA != '0':
            s2 = '{}: -{}'.format(sysV[index], eA)
        if s1 and s2:
            s = s1 + ', ' + s2
        else:
            s = (s1 or s2) or s
        #sp.LookupParameter('Комментарии').Set(s + ', ' + pritok[index] + ', ' + vityajka[index])
        s += '\n{}, {}, {}'.format(categ[index], pritok[index], vityajka[index])  # Доп инфа
        sp.LookupParameter('Комментарии').Set(s)
        sp.LookupParameter('ADSK_Наименование приточной системы').Set(sysP[index])
        sp.LookupParameter('ADSK_Наименование вытяжной системы').Set(sysV[index])
        # sp.LookupParameter('Фильтр').Set(pritok[index])
        # sp.LookupParameter('Вытяжка').Set(vityajka[index])
        #if sA: s.LookupParameter('ADSK_Расчетный приток').Set(int(sA))
        # elif not(s.LookupParameter('ADSK_Расчетный приток').AsDouble()): s.LookupParameter('ADSK_Расчетный приток').Set(sA)
        #if eA: s.LookupParameter('ADSK_Расчетная вытяжка').Set(eA)
        # elif not(s.LookupParameter('ADSK_Расчетная вытяжка').AsDouble()): s.LookupParameter('ADSK_Расчетная вытяжка').Set(eA)
    else:
        print('В таблице нет {} {}'.format(
            n, sp.LookupParameter('Имя').AsString()))

print('--------------------------------------------------------')

for sp in sorted(list(set(nums))):
    if sp not in existNums:
        print('В модели нет {}'.format(sp))
t.Commit()
